-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2025-04-27 14:02:48
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `group_05`
--

-- --------------------------------------------------------

--
-- 資料表結構 `members`
--

CREATE TABLE `members` (
  `member_id` varchar(255) NOT NULL,
  `username` varchar(255) NOT NULL,
  `email` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `phone` varchar(11) NOT NULL,
  `register_date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `members`
--

INSERT INTO `members` (`member_id`, `username`, `email`, `password`, `phone`, `register_date`) VALUES
('1', 'admin', 'admin@gmail.com', 'admin123456', '900000000', '2025-04-10'),
('2', 'member', 'member@gmail.com', 'member123456', '900000001', '2025-04-10'),
('3', 'name001', 'email001@gmail.com', 'password001', '900123123', '2025-04-10');

-- --------------------------------------------------------

--
-- 資料表結構 `orders`
--

CREATE TABLE `orders` (
  `order_id` varchar(255) NOT NULL,
  `member_id` varchar(255) NOT NULL,
  `username` varchar(255) NOT NULL,
  `order_date` date NOT NULL,
  `total_price` int(11) NOT NULL,
  `status` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `orders`
--

INSERT INTO `orders` (`order_id`, `member_id`, `username`, `order_date`, `total_price`, `status`) VALUES
('1', '1', 'n1', '2025-03-28', 1234, '備貨中'),
('2', '222', 'n2', '2025-03-28', 4321, '已出貨');

-- --------------------------------------------------------

--
-- 資料表結構 `product_img`
--

CREATE TABLE `product_img` (
  `img_id` varchar(100) NOT NULL,
  `product_id` varchar(100) NOT NULL,
  `img_url` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `product_img`
--

INSERT INTO `product_img` (`img_id`, `product_id`, `img_url`) VALUES
('Pimg_0001', 'P_0001', 'images/product-details/Pimg_0001.jpg'),
('Pimg_0002', 'P_0002', 'images/product-details/Pimg_0002.jpg'),
('Pimg_0003', 'P_0003', 'images/product-details/Pimg_0003.jpg'),
('Pimg_0004', 'P_0004', 'images/product-details/Pimg_0004.jpg'),
('Pimg_0005', 'P_0005', 'images/product-details/Pimg_0005.jpg'),
('Pimg_0006', 'P_0006', 'images/product-details/Pimg_0006.jpg'),
('Pimg_0007', 'P_0007', 'images/product-details/Pimg_0007.jpg'),
('Pimg_0008_1', 'P_0008', 'images/product-details/Pimg_0008_1.jpg'),
('Pimg_0008_2', 'P_0008', 'images/product-details/Pimg_0008_2.jpg'),
('Pimg_0009', 'P_0009', 'images/product-details/Pimg_0009.jpg'),
('Pimg_0010_1', 'P_0010', 'images/product-details/Pimg_0010_1.jpg'),
('Pimg_0010_2', 'P_0010', 'images/product-details/Pimg_0010_2.jpg'),
('Pimg_0011_1', 'P_0011', 'images/product-details/Pimg_0011_1.jpg'),
('Pimg_0011_2', 'P_0011', 'images/product-details/Pimg_0011_2.jpg'),
('Pimg_0012', 'P_0012', 'images/product-details/Pimg_0012.jpg'),
('Pimg_0013', 'P_0013', 'images/product-details/Pimg_0013.jpg'),
('Pimg_0014', 'P_0014', 'images/product-details/Pimg_0014.jpg'),
('Pimg_0015', 'P_0015', 'images/product-details/Pimg_0015.jpg'),
('Pimg_0016', 'P_0016', 'images/product-details/Pimg_0016.jpg'),
('Pimg_0017', 'P_0017', 'images/product-details/Pimg_0017.jpg'),
('Pimg_0018', 'P_0018', 'images/product-details/Pimg_0018.jpg'),
('Pimg_0019', 'P_0019', 'images/product-details/Pimg_0019.jpg'),
('Pimg_0020', 'P_0020', 'images/product-details/Pimg_0020.jpg'),
('Pimg_0021', 'P_0021', 'images/product-details/Pimg_0021.jpg'),
('Pimg_0022', 'P_0022', 'images/product-details/Pimg_0022.jpg'),
('Pimg_0023', 'P_0023', 'images/product-details/Pimg_0023.jpg'),
('Pimg_0024', 'P_0024', 'images/product-details/Pimg_0024.jpg'),
('Pimg_0025', 'P_0025', 'images/product-details/Pimg_0025.jpg'),
('Pimg_0026', 'P_0026', 'images/product-details/Pimg_0026.jpg'),
('Pimg_0027', 'P_0027', 'images/product-details/Pimg_0027.jpg'),
('Pimg_0028', 'P_0028', 'images/product-details/Pimg_0028.jpg'),
('Pimg_0029', 'P_0029', 'images/product-details/Pimg_0029.jpg'),
('Pimg_0030', 'P_0030', 'images/product-details/Pimg_0030.jpg'),
('Pimg_0031_1', 'P_0031', 'images/product-details/Pimg_0031_1.jpg'),
('Pimg_0031_2', 'P_0031', 'images/product-details/Pimg_0031_2.jpg'),
('Pimg_0032', 'P_0032', 'images/product-details/Pimg_0032.jpg'),
('Pimg_0033', 'P_0033', 'images/product-details/Pimg_0033.jpg'),
('Pimg_0034', 'P_0034', 'images/product-details/Pimg_0034.jpg'),
('Pimg_0035', 'P_0035', 'images/product-details/Pimg_0035.jpg'),
('Pimg_0036', 'P_0036', 'images/product-details/Pimg_0036.jpg'),
('Pimg_0037', 'P_0037', 'images/product-details/Pimg_0037.jpg'),
('Pimg_0038', 'P_0038', 'images/product-details/Pimg_0038.jpg'),
('Pimg_0039', 'P_0039', 'images/product-details/Pimg_0039.jpg'),
('Pimg_0040', 'P_0040', 'images/product-details/Pimg_0040.jpg'),
('Pimg_0041', 'P_0041', 'images/product-details/Pimg_0041.jpg'),
('Pimg_0042', 'P_0042', 'images/product-details/Pimg_0042.jpg'),
('Pimg_0043', 'P_0043', 'images/product-details/Pimg_0043.jpg'),
('Pimg_0044', 'P_0044', 'images/product-details/Pimg_0044.jpg'),
('Pimg_0045', 'P_0045', 'images/product-details/Pimg_0045.jpg'),
('Pimg_0046', 'P_0046', 'images/product-details/Pimg_0046.jpg'),
('Pimg_0047', 'P_0047', 'images/product-details/Pimg_0047.jpg'),
('Pimg_0048', 'P_0048', 'images/product-details/Pimg_0048.jpg'),
('Pimg_0049', 'P_0049', 'images/product-details/Pimg_0049.jpg'),
('Pimg_0050', 'P_0050', 'images/product-details/Pimg_0050.jpg'),
('Pimg_0051', 'P_0051', 'images/product-details/Pimg_0051.jpg'),
('Pimg_0052', 'P_0052', 'images/product-details/Pimg_0052.jpg'),
('Pimg_0053', 'P_0053', 'images/product-details/Pimg_0053.jpg'),
('Pimg_0054', 'P_0054', 'images/product-details/Pimg_0054.jpg'),
('Pimg_0055', 'P_0055', 'images/product-details/Pimg_0055.jpg');

-- --------------------------------------------------------

--
-- 資料表結構 `product_info`
--

CREATE TABLE `product_info` (
  `product_id` varchar(255) NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `short_description` text NOT NULL,
  `full_description` text NOT NULL,
  `price` int(11) NOT NULL,
  `stock` int(11) NOT NULL,
  `category` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `product_info`
--

INSERT INTO `product_info` (`product_id`, `product_name`, `short_description`, `full_description`, `price`, `stock`, `category`) VALUES
('P_0001', '嚴選好禮- 雙蜜組(2025年節禮盒)', '天然龍眼蜜420克、天然荔枝蜜420克 各1瓶', '2025年節禮盒彰化縣農會 #精選禮盒甜甜蜜過新年嚴選好禮- #雙蜜組 $850- 天然龍眼蜜、天然荔枝蜜 營養美味同時兼具- 訂/截/匯款日 : 2025 / 01 / 17▪️運費計算：購買1至4盒，運費為$140(超過4盒請先電話連絡)▪️匯款帳戶：    戶名:彰化縣農會農產品展售中心    帳號:00685102010291/台北富邦彰化分行012▪️本會官網線上購物不支援外島寄送服務本會展售中心取貨免運費(需先付款)▪️彰化市中山路二段349號1樓▪️連絡電話：04-7263460▪️營業時間：每週一～週五▪️AM 8:00 ～ PM 5:00#新春送禮 #過年好禮', 850, 10, '禮盒專區'),
('P_0002', '🙏🙏中元祭 普渡特選組合(1組18樣)', '🙏🙏#中元祭 🙏普渡特選組合(1組18樣)💲999', '🙏🙏#中元祭 🙏普渡特選組合(1組18樣)💲9991迷你小蛋餅*12廣吉大燕麥片280g*13愛之味甜八寶380ml*14誠泰寬版醬油禮盒*15彰農平安米1kg*16活點關廟麵250g*17高級精鹽1000g*18喜年來小蔬菜餅*19掬水軒胡椒烤蘇打餅*110橘平屋韓式海苔4.2g*111小舒跑245ml*112蝴蝶蘭冬粉100g*113愛之味麥仔茶(無糖)580g*114泰山陽光種子調合油1L*115特級砂糖500g*116龍口炊粉250g*117味味單入包麵*118自然顏香蔥蘇打餅*1🍚 #彰農祈福米 有拜有保庇四格禮盒裝👉方便買·輕鬆拜', 999, 1, '🙏禮盒專區'),
('P_0003', '🌈福農肉粽-爌肉香菇粽(宅配訂購區)', '🌈福農肉粽-爌肉香菇粽(宅配訂購區)\r\n⋯每 盒 十 顆 裝⋯\r\n▪️爌肉香菇蛋黃粽(180±10g) ⋯$750\r\n運費計算\r\n1-8盒: $160 (8盒以上請先電話聯絡)', '100%使用福興鄉在地長糯米\r\n生產工廠通過國際ISO22000、HACCP國際食品品質安全認證 產品均經急速冷凍殺菌，品質絕對有保障\r\n主要食材原物料，原產地均為台灣\r\n(以上節自福興鄉農會官網)\r\n\r\n🔥 年年熱銷，每年賣到缺貨！\r\n\r\n⋯每 盒 十 顆 裝⋯\r\n▪️爌肉香菇粽(180±10g) ⋯$750\r\n運費計算\r\n1-8盒: $160 (8盒以上請先電話聯絡)\r\n\r\n✅最後訂購日/匯款日/出貨日：2024/05/24(五)\r\n✅ 匯款帳戶：\r\n     戶名:彰化縣農會農產品展售中心\r\n     帳號:00685102010291 \r\n     台北富邦彰化分行012\r\n⚠️ 匯款完，請將帳號末5碼回傳給\r\n👉 彰化管仲 🔗 https://lin.ee/M4OPlF8\r\n\r\n\r\n✅ 如已過預購時間，訂單將於端午節後出貨\r\n★★★本會展售中心自取區 自取免運費★★★\r\n\r\n---------------------退換貨，很重要，訂購前一定要詳讀---------------------\r\n📍退貨條件：食品類商品無7天鑑賞期，除商品本身有瑕疵可辦理退貨，商品一經使用或損毀即不可退貨，退貨必須保留紙箱及商品組合之齊全及完整性。', 750, 1, '禮盒專區'),
('P_0004', '🌈福農肉粽-古早味香菇素粽', '🌈福農肉粽-古早味香菇素粽(本會展售中心自取區)\r\n⋯每 盒 十 顆 裝⋯\r\n▪️古早味香菇素粽(180±10g) ⋯$650\r\n⋯免運費⋯', '100%使用福興鄉在地長糯米\r\n生產工廠通過國際ISO22000、HACCP國際食品品質安全認證 產品均經急速冷凍殺菌，品質絕對有保障\r\n主要食材原物料，原產地均為台灣\r\n(以上節自福興鄉農會官網)\r\n\r\n🔥 年年熱銷，每年賣到缺貨！\r\n\r\n⋯每 盒 十 顆 裝⋯\r\n▪️古早味香菇素粽(180±10g) ⋯$650\r\n⋯免運費⋯\r\n\r\n✅最後訂購日/匯款日/出貨日：2024/05/24(五)\r\n✅ 匯款帳戶：\r\n     戶名:彰化縣農會農產品展售中心\r\n     帳號:00685102010291 \r\n     台北富邦彰化分行012\r\n⚠️ 匯款完，請將帳號末5碼回傳給\r\n👉 彰化管仲 🔗 https://lin.ee/M4OPlF8\r\n\r\n\r\n✅ 如已過預購時間，訂單將於端午節後出貨\r\n✅ 本產品圖片僅供參考，實品請以實物為止\r\n✅面交取貨：\r\n    ▪️彰化縣農會展售中心\r\n    ▪️地址：彰化市中山路二段349號1樓\r\n    ▪️電話：04-7263460\r\n    ▪️營業時間:每週一～五 AM8:00~PM5:00\r\n★★★如需宅配，請至宅配訂購區訂購★★★\r\n\r\n---------------------退換貨，很重要，訂購前一定要詳讀---------------------\r\n📍退貨條件：食品類商品無7天鑑賞期，除商品本身有瑕疵可辦理退貨，商品一經使用或損毀即不可退貨，退貨必須保留紙箱及商品組合之齊全及完整性。', 650, 1, '禮盒專區'),
('P_0006', '🌈彰化區漁會-饅意粽', '🌈彰化區漁會-饅意粽(本會展售中心自取)\r\n⋯每 盒 10 顆 裝⋯\r\n⋯205克±5克(顆)⋯\r\n⋯免運費⋯', '🌈彰化區漁會-饅意粽(本會展售中心自取)\r\n⋯每 盒 10 顆 裝⋯\r\n⋯205克±5克(顆)⋯\r\n⋯免運費⋯\r\n\r\n成份：糯米、豬肉、鰻魚、釀造醬油(水、非基因改造黃豆、小麥、食鹽、蔗糖、食用酒精、酵母粉)、香菇、菜脯、赤尾青蝦皮、紅蔥頭、食鹽、糖。\r\n\r\n保存方法：-18℃以下冷凍\r\n有效期限：標示於外包裝上\r\n原產地：台灣\r\n食用方式：\r\n1.無須解凍：直接放電鍋一杯水，蒸30分鐘~40分鐘即可食用。\r\n2.先解凍：直接放電鍋一杯水，蒸15分鐘~20分鐘(內有蒲燒鰻 請勿重複解凍影響風味)\r\n■過敏原資訊：本產品含鰻魚、蝦、大豆及其製品不適合對其過敏者食用\r\n(以上說明節自彰化區漁會供銷部官網)\r\n\r\n\r\n✅ 2024/5/31最後訂購日/最後匯款日/最後出貨日\r\n✅ 匯款帳戶：\r\n     戶名:彰化縣農會農產品展售中心\r\n     帳號:00685102010291 \r\n     台北富邦彰化分行012\r\n\r\n✅ 如已過預購時間，訂單將於端午節後出貨\r\n✅ 本產品圖片僅供參考，實品請以實物為止\r\n✅面交取貨：\r\n    ▪️彰化縣農會展售中心\r\n    ▪️地址：彰化市中山路二段349號1樓\r\n    ▪️電話：04-7263460\r\n    ▪️營業時間:每週一～五 AM8:00~PM5:00\r\n\r\n★★★如需宅配，請至宅配訂購區訂購★★★\r\n\r\n🔥 年年熱銷，每年賣到缺貨！\r\n\r\n\r\n---------------------退換貨，很重要，訂購前一定要詳讀---------------------\r\n📍退貨條件：食品類商品無7天鑑賞期，除商品本身有瑕疵可辦理退貨，商品一經使用或損毀即不可退貨，退貨必須保留紙箱及商品組合之齊全及完整性。', 950, 1, '禮盒專區'),
('P_0007', '🌈彰化區漁會-春節高級國產禮盒', '—— 彰化區漁會 精選禮盒——\r\n🌈彰化區漁會-春節高級國產禮盒\r\n吃原型吃新鮮\r\n國產漁獲讓您年年有餘 🐟\r\n\r\n濃郁香氣·鮮嫩肥美的海味\r\n🎁 送禮大方讓您走路龍舞風', '★彰化區漁會精選--春節高級國產禮盒\r\n內容物\r\n石斑魚1尾(600-700克/尾)\r\n白蝦1盒(約230克/盒)\r\n鱸魚片1片(約250-300克/包)\r\n龍膽石斑片1包(約300克/包)\r\n基隆小卷1包(約300克/包)\r\n午仔魚一夜干1尾(350-400克/尾)\r\n特別加贈虱目魚丸1包(600克/包)\r\n\r\n#國產最新鮮\r\n#吃貨必買\r\n\r\n\r\n\r\n---------------------退換貨，很重要，訂購前一定要詳讀---------------------\r\n⚠依據「通訊交易解除權合理例外情事適用準則」第2條第一項：「易於腐敗、保存期限較短或解約時即將逾期」之商品，屬於消費者保護法第19條第一項但書所稱合理例外情事。自105年1月1日起，生鮮食品不適用於消費者保護法第19條，並不享有7天鑑賞期。\r\n\r\n⚠退換貨注意事項：\r\n   1.鑑賞期依法規定為收到產品隔日起7日內，超過7天鑑賞期恕不提供退換貨服務。\r\n   2.請保持商品本體、內外包裝的完整性，並妥善保存。\r\n   3.退換貨前，請放置冰箱冷藏儲存，避免產品變質。\r\n   4.食品類商品，因衛生考量，在還不確定是否要辦理退換貨以前，請勿拆封、試吃，避免影響您的退/換貨權益。\r\n\r\n⚠當有瑕疵產品疑慮時，辦理方式：\r\n   1.收到貨1天內請與我們聯繫，並提供收到的產品照片(外箱、內容物)，本會將盡速為您協助。\r\n   2.電話客服：04-7263460(服務時間星期一~五 AM8:00~PM5:00)\r\n   3.官方LINE：彰化管仲', 1500, 1, '禮盒專區'),
('P_0008', '2023農會百大精品禮盒-香得益彰禮盒', '--本產品榮獲2023農會百大精品禮盒--\r\n\r\n台稉9號米       1.2公斤x1包\r\n紫黑米             1.0公斤x1包\r\n紅薏仁雪花片  200克x1包', '經由本會挑選濁水溪流域之優良米、溪州稻米生產專區、二林雜糧作物生產等區，所生產優質農產品加工組合而成的最佳伴手禮。', 600, 1, '禮盒專區'),
('P_0009', '🌈蕎麥紅薏仁隨身包', '產       地： 台灣\r\n\r\n規　　格： 30±5g/包、10包/盒\r\n\r\n包　　裝： 盒裝\r\n\r\n保存期限： 1年\r\n\r\n保存方法： 請放置於乾燥陰涼處，開封後請儘早飲用完畢。', '二林在地紅薏仁(台中1號)、蕎麥製成，製程堅持不添加任何化學添加物，且含有豐富維他素 P 1、B 2、B 1、E、鈣、鋅、鎂、鐵、磷等多種有益健康的營養元素，讓您迅速補充人體一天所需的營養，是現代人的食尚新選擇。\r\n隨身包採獨立包裝、攜帶方便、輕鬆沖泡、隨沖即食，冷熱沖泡美味都不變、份量多寡自己選擇，無論何時讓美味與健康永遠相伴左右。每包隨身包請用250c.c.熱開水沖泡或是依個人喜好加入適量的牛奶、果汁、豆漿，即可飲用，促進新陳代謝、幫助消化、健康維持，兼顧營養與便利。生產廠房通過SGS、ISO 22000及HACCP國際雙認證。', 160, 1, '1'),
('P_0010', '🌈嚴選好禮-農情禮讚', '🌈嚴選好禮-農情禮讚內容物：▪️彰農米-台稉9號米1.2公斤X1包▪️黑木耳養生露470毫升(固型體85克)X1瓶▪️紅薏仁粒450克±3%X1包', '★本會台稉9號米經環球國際驗證機構驗證，驗證通過符合「農產品產銷履歷驗證」，歡迎消費者安心食用。純正濁水溪流域出產的稻穀。濁水溪上游夾帶砂礫土及黏土沖積而成，屬於黏板岩及砂岩風化之沖積土壤，是微鹼性的暗灰色土壤且表土深厚、肥沃，富含微量元素。經政府單位積極輔導，透過低溫冷藏筒儲存當期新稻穀，配合全自動化生產設備及嚴格的品質管制。採最新式大型洗米機及色彩選別機所精緻而成，粒粒飽滿晶瑩剔透，純淨無汙染，是您全家人最佳的營養主食。★和美鎮農會黑木耳養生露嚴選台灣本土天然食材新鮮黑木耳及優質紅棗。採真空高溫殺菌，小瓶包裝，攜帶方便。★二林鎮農會紅薏仁粒450g±5%/包嚴選二林在地紅薏仁(台中3號)。適合老人家的營養補給，是全家大小最天然的養生食材。', 425, 1, '禮盒專區'),
('P_0011', '🌈彰化鮮物禮盒-腴米之鄉', '—— 彰化區漁會 聯名禮盒——🌈彰化鮮物禮盒-腴米之鄉內容物：▪️彰農米-台稉9號米1.2公斤X2包▪️彰漁鮭魚酥300公克X1罐', '★本會台稉9號米經環球國際驗證機構驗證，驗證通過符合「農產品產銷履歷驗證」，歡迎消費者安心食用。純正濁水溪流域出產的稻穀。濁水溪上游夾帶砂礫土及黏土沖積而成，屬於黏板岩及砂岩風化之沖積土壤，是微鹼性的暗灰色土壤且表土深厚、肥沃，富含微量元素。經政府單位積極輔導，透過低溫冷藏筒儲存當期新稻穀，配合全自動化生產設備及嚴格的品質管制。採最新式大型洗米機及色彩選別機所精緻而成，粒粒飽滿晶瑩剔透，純淨無汙染，是您全家人最佳的營養主食。★彰化區漁會鮭魚酥精選上等鮭魚製作，營養成分高、風味獨特又香酥誠信保證，不添加防腐劑及色素，本產品已通過塑化劑檢測，請民眾安心食用。', 650, 1, '禮盒專區'),
('P_0012', '🌈2023彰化縣龍眼蜜評鑑頭等獎-龍爺蜜', '彰化縣蜂農們精心培育出來的龍眼蜜\r\n主要蜜源為龍眼花\r\n經由蜜蜂採集龍眼花蜜釀製而成 🐝\r\n\r\n#2023彰化縣龍眼蜜評鑑頭等獎 #龍爺蜜\r\n無論是自己品嚐，還是送給親朋好友👯\r\n都能感受到 #龍爺蜜 的獨特香氣魅力 💕\r\n\r\n💕 甜蜜推廣優惠 800元 / 盒 💕', '🎵 甜蜜蜜～ 你笑的甜蜜蜜 🥰\r\n\r\n彰化縣蜂農們精心培育出來的龍眼蜜\r\n主要蜜源為龍眼花\r\n經由蜜蜂採集龍眼花蜜釀製而成 🐝\r\n\r\n每一滴都蘊含著陽光、土地與蜂農的心血\r\n嚐一口 大自然的美好韻味  👍\r\n享受著 舌尖上的極致甜蜜 💕😋\r\n\r\n#2023彰化縣龍眼蜜評鑑頭等獎 #龍爺蜜\r\n無論是自己品嚐，還是送給親朋好友👯\r\n都能感受到 #龍爺蜜 的獨特香氣魅力 💕\r\n\r\n💕 甜蜜推廣優惠 800元 / 盒 💕\r\n* * 運費：1-6盒180元 * *(超過6盒請先詢問運費^^)\r\n\r\n#彰化縣第二屆國產龍眼蜂蜜 #頭等獎\r\n#Longan #Honey', 800, 1, '1'),
('P_0013', 'SWEET工坊-蜂蜜禮盒', '1)荔枝蜜*1重量:140公克\r\n2)龍眼蜜*1重量:140公克\r\n3)百花蜂蜜醋*1重量:180毫升', '1)荔枝蜜*1\r\n成分:天然蜂蜜\r\n重量:140公克\r\n原產地:台灣\r\n生產者:甜蜜蜜蜂園\r\n保存期限:二年\r\n有效期限:瓶身標示為主\r\n蜂蜜結晶屬自然現象請安心使用。一歲以下幼兒請勿食用。\r\n\r\n2)龍眼蜜*1\r\n成分:天然蜂蜜\r\n重量:140公克\r\n原產地:台灣\r\n生產者:甜蜜蜜蜂園\r\n保存期限:二年\r\n有效期限:瓶身標示為主\r\n蜂蜜結晶屬自然現象請安心使用。一歲以下幼兒請勿食用。\r\n\r\n3)百花蜂蜜醋*1\r\n成分:水、釀造醋、天然蜂蜜\r\n重量:180毫升\r\n原產地:台灣\r\n經銷商:甜蜜蜜蜂園\r\n保存期限:二年\r\n有效期限:瓶身標示為主\r\n本產品屬天然蜂蜜釀造，久置若有花粉質懸浮或沉澱純屬自然現象。', 690, 1, '1'),
('P_0014', '中秋節烤肉組 現正預購中', '🦑 海陸大拼盤 🐔\r\n烤得有創意 · 省得你忘記\r\n\r\n飛魚卵香腸、無骨雞腿排、鯖魚片、魷魚串、午仔魚一夜干、公香魚、白蝦\r\n#縣農嘎哩攢便便 😋 只要 👉 1200元 👈\r\n【 運費：低溫160元/(1~2組)】🔥 小貼士：本會展售中心自取免運費喔！', '🟠 中秋節烤肉組 現正預購中🔥\r\n\r\n🦑 海陸大拼盤 🐔\r\n烤得有創意 · 省得你忘記\r\n\r\n飛魚卵香腸、無骨雞腿排\r\n鯖魚片、魷魚串、午仔魚一夜干\r\n公香魚、白蝦\r\n#縣農嘎哩攢便便 😋 只要 👉 1200元 👈\r\n【 運費：低溫160元/(1~2組)】\r\n🔥 小貼士：本會展售中心自取免運費喔！\r\n\r\n▪️ 訂購&匯款截止日：8/26\r\n▪️ 取貨日：8/18陸續出貨\r\n（如需提前出貨，請先電話連絡)\r\n▪️ 最後出貨日：9/1\r\n▪️ 匯款帳戶：\r\n     戶名:彰化縣農會農產品展售中心\r\n     帳號:00685102010291 \r\n     台北富邦彰化分行012\r\n⚠️ 匯款完，請將帳號末5碼回傳給\r\n👉 彰化管仲 🔗 https://lin.ee/M4OPlF8\r\n🔺詳情請洽本會展售中心\r\n\r\n💐 線上傳送門 🛒\r\n🔗 https://forms.gle/9cn1MQKxg9V6AzMo6', 1200, 1, '禮盒專區'),
('P_0015', '農情蜜意蜂蜜', '龍眼蜂蜜           700公克/瓶', '龍眼蜂蜜           700公克/瓶', 500, 1, '禮盒專區'),
('P_0016', '彰化新三寶精緻禮盒', '八卦山咖啡    10公克x8包/盒\r\n龍眼蜂蜜        420公克x1罐\r\n養生飲品        30公克x8包/盒', '八卦山咖啡    10公克x8包/盒\r\n龍眼蜂蜜        420公克x1罐\r\n養生飲品        30公克x8包/盒', 800, 1, '禮盒專區'),
('P_0017', '精裝版-竹塘飄䅨米禮盒', '台中194號香米(竹塘鄉農會-竹塘飄䅨米)600公克x3', '台中194號香米(竹塘鄉農會-竹塘飄䅨米)600公克x3\r\n\r\n\r\n有著歷屆全國性稻米品質競賽榮耀的加持，以及上天賜與知足辛勤稻農的良田美地，化成豐碩的竹塘米。口感Q彈細緻，吸收了濁水溪的精華，造就竹塘米擁有獨一無二的美味口感，更是祝福親朋好友們幸福米滿的最佳選擇。\r\n\r\n「台中194號香米」，竹塘鄉農會命名為「竹塘飄䅨米」，在竹塘鄉已種植多年，口感Q彈，有點黏又不黏口，蘊含特殊香氣，烹煮食處處飄散濃郁米香，有米界鴉片的美譽，讓人吃了還想再吃一碗。\r\n(本文節自竹塘鄉農會官網)', 330, 1, '禮盒專區'),
('P_0018', '知竹嚐樂禮盒', '台稉9號米     1公斤x3包', '台稉9號米     1公斤x3包', 450, 1, '禮盒專區'),
('P_0019', '大城黃豆', '規格：600公克', '規格：600公克', 150, 1, '禮盒專區'),
('P_0020', '健康麥', '規格：800公克', '規格：800公克', 120, 1, '禮盒專區'),
('P_0021', '極品茉莉賞茶', '極品茉莉烏龍          150公克x1\r\n極品茉莉金萱          150公克x1', '極品茉莉烏龍          150公克x1\r\n極品茉莉金萱          150公克x1', 1530, 1, '禮盒專區'),
('P_0022', '富貴養生禮盒', '桂圓麵          300公克x2包\r\n桂圓肉          300公克x1盒\r\n台稉9號米     900公克x1包', '桂圓麵          300公克x2包\r\n桂圓肉          300公克x1盒\r\n台稉9號米     900公克x1包', 650, 1, '禮盒專區'),
('P_0023', '富貴樂禮盒', '桂圓肉     300公克x1盒\r\n桂圓麵     300公克x4包', '桂圓肉     300公克x1盒\r\n桂圓麵     300公克x4包', 690, 1, '禮盒專區'),
('P_0024', '土豆麥酥禮盒', '250公克x2包/盒', '250公克x2包/盒', 300, 1, '禮盒專區'),
('P_0025', '富貴良緣禮盒', '桂圓蜜    390公克x2罐\r\n桂圓肉    300公克x1盒', '桂圓蜜    390公克x2罐\r\n桂圓肉    300公克x1盒', 1100, 1, '禮盒專區'),
('P_0026', '黃金薯麵線禮', '黃金蕃薯麵線    360公克x1包\r\n紅麴蕃薯麵線    360公克x1包\r\n黃金蕃薯Q麵     360公克x1包', '黃金蕃薯麵線    360公克x1包\r\n紅麴蕃薯麵線    360公克x1包\r\n黃金蕃薯Q麵     360公克x1包', 360, 1, '禮盒專區'),
('P_0027', '麵麵俱到禮盒', '牛奶麵    300公克x7包', '牛奶麵    300公克x7包', 560, 1, '禮盒專區'),
('P_0028', '茉莉茶集-茉莉烏龍', '2.2公克x15/袋', '2.2公克x15/袋', 390, 1, '禮盒專區'),
('P_0029', '御品茉莉賞茶禮盒', '御品茉莉烏龍150公克x1\r\n御品茉莉紅茶  75公克x1', '御品茉莉烏龍150公克x1\r\n御品茉莉紅茶  75公克x1', 1580, 1, '禮盒專區'),
('P_0030', '青梅釀時光', '青梅釀時光', '度數：11度\r\n原料：梅子\r\n產地：台灣\r\n \r\n以台灣南投青梅釀造 結合了葡萄白蘭地 讓這款青梅釀時光梅酒 譜出了 香氣重 微酸 帶甜 三重奏的口感', 800, 1, '酒莊產品'),
('P_0031', '頂級葡萄酒750ml季節限量12月冬果', '頂級葡萄酒750ml季節限量12月冬果', '冬季葡萄量少皮厚香味濃郁，不易採收。\r\n\r\n \r\n\r\n葡萄酒中夢幻酒品，酒客的最愛！', 800, 1, '酒莊產品'),
('P_0032', '傾慕 750ml', '傾慕 750ml', '度數：14度\r\n\r\n產地：彰化二林\r\n\r\n品種：金香葡萄\r\n\r\n口感：是一款帶有淡淡的梅子香氣，口感濃郁而滑順，我們是經過不銹鋼桶及橡木桶的存放，轉桶再轉桶，是一款極具特色且唯一的限量酒款', 1800, 1, '酒莊產品'),
('P_0033', '戀戀葡萄蒸餾酒 400ml', '度數：48度\r\n產地：彰化縣二林鎮\r\n品種：金香葡萄', '度數：48度\r\n產地：彰化縣二林鎮\r\n品種：金香葡萄\r\n口感：以金香山葡萄發酵後 經蒸餾後 而只取酒心 酒品呈無色透明 口感濃烈而順口 具有高尚又無暇的感覺 存放的時間越久越香醇 正代表著情侶間情感 長長久久。', 500, 1, '酒莊產品'),
('P_0034', '戀戀葡萄蒸餾酒 400ml', '戀戀葡萄蒸餾酒 400ml', '以金香葡萄蒸餾 取48度酒心，在經過橡木桶熟成、純化。口感清香而不嗆辣帶著濃濃的橡木桶香。喜歡白蘭地的朋友一定不能錯過', 690, 1, '酒莊產品'),
('P_0035', '玫瑰花醋', '以糯米醋為基底\r\n浸泡埔里無毒食用玫瑰花瓣之調理醋\r\n玫瑰清香撲鼻\r\n釋放於醋裡\r\n更顯現出濃郁芳香', '品名:玫瑰花醋\r\n成分: 糯米醋、砂糖、玫瑰花瓣、水\r\n內容量: 375毫升\r\n酸度: 1.5%以上\r\n保存期限: 2年\r\n原產地: 台灣\r\n使用方法: 加入1-3倍開水稀釋飲用，稀釋程度可依照個人喜好調整\r\n保存方法: 請置於陰涼處，避免陽光直接照射，如有褐變，屬自然現象，請安心食用\r\n\r\n出品:埔里鎮農會農村休閒酒莊', 380, 1, '酒莊產品'),
('P_0036', '百香果醋', '以糯米醋為基底\r\n浸泡埔里優質百香果汁之調理醋\r\n百香果的獨特香氣\r\n酸甜的口感\r\n顯現出濃郁的果香', '品名: 百香果醋\r\n成分: 糯米醋、砂糖、百香果汁\r\n內容量: 375毫升\r\n酸度: 2.0%以上\r\n保存期限: 2年\r\n原產地: 臺灣\r\n使用方法: 加入1-3倍開水稀釋飲用，稀釋程度可依照個人喜好調整\r\n保存方法: 請置於陰涼處，避免陽光直接照射，如有褐變，屬自然現象，請安心食用\r\n\r\n出品:埔里鎮農會農村休閒酒莊', 380, 1, '酒莊產品'),
('P_0037', '山形玫瑰花瓣醬', '迷人的香氣\r\n遍尋世界的品種，終於找到擁有\r\n顏色深紅華美、花型優美\r\n花瓣絲絨般溫潤\r\n馥郁甜香、口感極佳的品種\r\n將玫瑰獨特迷人香氣\r\n完整真實的呈現給你', '品名: 山形玫瑰花瓣醬\r\n淨重: 150公克(g)*2入\r\n成分: 砂糖、食用玫瑰花瓣、果膠、檸檬酸\r\n保存方式: 開封後請冷藏\r\n保存期限: 一年(未開封)\r\n產地: 台灣\r\n出品:埔里鎮農會農村休閒酒莊', 450, 1, '酒莊產品'),
('P_0038', '百香果汁', '濃縮果汁', '品名:百香果汁成分:百香果20%、果糖、蔗糖、水、檸檬酸、醋磺內酯鉀(甜味劑)、玉米醣膠(黏稠劑)、己二烯酸鉀(防腐劑)、食用黃色4號色素、食用黃色5號色素、食用香料內容量:800g±15g保存期限:一年產地:臺灣', 220, 1, '果汁系列'),
('P_0039', '玫瑰花釀', '濃縮果汁', '品名:玫瑰花釀\r\n成分:果糖、蜂蜜、蔗糖、玫瑰花、水、檸檬酸、醋磺內酯鉀(甜味劑)、玉米醣膠(黏稠劑)、己二烯酸鉀(防腐劑)、紅色40號色素、食用香料\r\n內容量:800g±15g\r\n保存期限:一年\r\n產地:臺灣', 220, 1, '果汁系列'),
('P_0040', '玫瑰花釀', '濃縮果汁', '品名:桂花釀\r\n成分:果糖、蔗糖、蜂蜜、桂花、醋磺內酯鉀(甜味劑)、玉米醣膠(黏稠劑)、己二烯酸鉀(防腐劑)、食用香料\r\n內容量:800g±15g\r\n保存期限:一年\r\n產地:臺灣', 220, 1, '果汁系列'),
('P_0041', '桑椹汁', '濃縮果汁', '品名:桑椹汁\r\n成分:桑椹20%、果糖、蔗糖、水、檸檬酸、醋磺內酯鉀(甜味劑)、玉米醣膠(黏稠劑)、己二烯酸鉀(防腐劑)、食用紅色40號色素、食用香料\r\n內容量:800g±15g\r\n保存期限:一年\r\n產地:臺灣', 220, 1, '果汁系列'),
('P_0042', '金桔汁', '濃縮果汁', '品名:金桔汁\r\n成分:金桔20%、果糖、水、檸檬酸、、玉米醣膠(黏稠劑)、己二烯酸鉀(防腐劑)、食用香料、β-胡蘿蔔素\r\n內容量:600ml±15ml\r\n保存期限:一年\r\n產地:臺灣', 220, 1, '果汁系列'),
('P_0043', '蔓越莓汁', '濃縮果汁', '品名:蔓越莓汁\r\n成分:蔓越莓20%、果糖、蔗糖、水、檸檬酸、醋磺內酯鉀(甜味劑)、果膠、玉米醣膠(黏稠劑)、己二烯酸鉀(防腐劑)、食用紅色40號色素、食用香料\r\n內容量:800g±15g\r\n保存期限:一年\r\n產地:臺灣', 220, 1, '果汁系列'),
('P_0044', '百香果豆腐乳', '非基因改造\r\n口感綿密回甘\r\n佐清粥、沾醬、炒菜、烹煮料理\r\n讓味道更美味', '品名:百香果豆腐乳內容物:黃豆(非基因改造)、水、糙米、食鹽、糖、百香果汁、食用酒精食品添加物:調味劑(胺基乙酸、琥珀酸二鈉)、甜味劑(甘草酸鈉、醋磺內酯鉀、蔗糖素)、品質改良劑(二氧化矽)內容量:345公克固形量:250公克過敏原:本產品含有大豆及其製品，不適合其過敏體質者食用原產地:台灣保存期限:二年', 120, 1, '醬菜類(罐頭食品)'),
('P_0045', '梅子豆腐乳', '非基因改造\r\n口感綿密回甘\r\n佐清粥、沾醬、炒菜、烹煮料理\r\n讓味道更美味', '品名:梅子豆腐乳\r\n內容物:黃豆(非基因改造)、水、糙米、食鹽、糖、烏梅汁、梅子\r\n食品添加物:胺基乙酸(調味劑)、琥珀酸二鈉(調味劑)、甘草酸鈉(甜味劑)、醋磺內酯鉀(甜味劑)、蔗糖素(甜味劑)、苯甲酸(防腐劑)、二氧化矽(品質改良劑)\r\n內容量:345公克\r\n固形量:250公克\r\n過敏原:本產品含有大豆，不適合其過敏體質者食用\r\n原產地:台灣\r\n保存期限:二年', 120, 1, '醬菜類(罐頭食品)'),
('P_0046', '鳳梨豆腐乳', '非基因改造\r\n口感綿密回甘\r\n佐清粥、沾醬、炒菜、烹煮料理\r\n讓味道更美味', '品名:鳳梨豆腐乳\r\n內容物:黃豆(非基因改造)、水、鹽、鳳梨果乾\r\n食品添加物:胺基丙酸(調味劑)、琥珀酸二鈉(調味劑)、甘草酸銨(甜味劑)、己二烯酸鉀(防腐劑)\r\n內容量:345公克\r\n固形量:250公克\r\n過敏原:本產品含有大豆及其製品，不適合其過敏體質者食用\r\n原產地:台灣\r\n保存期限:二年', 120, 1, '醬菜類(罐頭食品)'),
('P_0047', '甜辣豆腐乳', '非基因改造\r\n口感綿密回甘\r\n佐清粥、沾醬、炒菜、烹煮料理\r\n讓味道更美味', '品名:甜辣豆腐乳\r\n內容物:黃豆(非基因改造)、水、糙米、食鹽、糖、辣椒粉、酒\r\n食品添加物:胺基乙酸(調味劑)、琥珀酸二鈉(調味劑)、甘草酸鈉(甜味劑)、醋磺內酯鉀(甜味劑)、蔗糖素(甜味劑)、苯甲酸(防腐劑)、二氧化矽(品質改良劑)\r\n內容量:345公克\r\n固形量:250公克\r\n過敏原:本產品含有大豆，不適合其過敏體質者食用\r\n原產地:台灣\r\n保存期限:二年', 120, 1, '醬菜類(罐頭食品)'),
('P_0048', '甜米豆腐乳', '非基因改造\r\n口感綿密回甘\r\n佐清粥、沾醬、炒菜、烹煮料理\r\n讓味道更美味', '品名:甜米豆腐乳\r\n內容物:黃豆(非基因改造)、水、糙米、食鹽、糖、食用酒精\r\n食品添加物:調味劑(胺基乙酸、琥珀酸二鈉)、甜味劑(甘草酸鈉、醋磺內酯鉀、蔗糖素)、品質改良劑(二氧化矽)\r\n內容量:345公克\r\n固形量:250公克\r\n過敏原:本產品含有大豆，不適合其過敏體質者食用\r\n原產地:台灣\r\n保存期限:二年', 120, 1, '醬菜類(罐頭食品)'),
('P_0049', '甜米豆腐乳', '非基因改造\r\n口感綿密回甘\r\n佐清粥、沾醬、炒菜、烹煮料理\r\n讓味道更美味', '品名:芋香豆腐乳\r\n內容物:黃豆(非基因改造)、水、糙米、食鹽、糖、芋頭香料\r\n食品添加物:胺基乙酸(調味劑)、琥珀酸二鈉(調味劑)、甘草酸鈉(甜味劑)、醋磺內酯鉀(甜味劑)、蔗糖素(甜味劑)、苯甲酸(防腐劑)、二氧化矽(品質改良劑)\r\n內容量:345公克\r\n固形量:250公克\r\n過敏原:本產品含有大豆，不適合其過敏體質者食用\r\n原產地:台灣\r\n保存期限:二年', 120, 1, '醬菜類(罐頭食品)'),
('P_0050', '紅麴豆腐乳', '非基因改造\r\n口感綿密回甘\r\n佐清粥、沾醬、炒菜、烹煮料理\r\n讓味道更美味', '品名:紅麴豆腐乳\r\n內容物:黃豆(非基因改造)、水、紅麴米、糙米、食鹽、糖\r\n食品添加物:胺基乙酸(調味劑)、琥珀酸二鈉(調味劑)、甘草酸鈉(甜味劑)、醋磺內酯鉀(甜味劑)、蔗糖素(甜味劑)、苯甲酸(防腐劑)、二氧化矽(品質改良劑)\r\n內容量:345公克\r\n固形量:250公克\r\n過敏原:本產品含有大豆，不適合其過敏體質者食用\r\n原產地:台灣\r\n保存期限:二年', 120, 1, '醬菜類(罐頭食品)'),
('P_0051', '剝皮辣椒', '全素', '品名:剝皮辣椒\r\n成份:青辣椒、黃豆醬油(非基因改造黃豆、水、鹽、小麥)、水、鹽、糖、胺基乙酸、DL-胺基丙酸、檸檬酸、L-麩酸鈉、5-次黃嘌呤核苷磷酸二鈉、5-鳥嘌呤核苷磷酸二鈉、乳酸鈣、甜味劑(甘草酸鈉)、檸檬酸鈉、麥芽糊精\r\n內容量:380公克\r\n固形量:170公克\r\n食用方法:直接加入主食即可食用\r\n保存期限:常溫下2年(開瓶後須冷藏)\r\n原產地:台灣\r\n過敏原:本產品含有黃豆及小麥，不適合其過敏體質者食用', 130, 1, '醬菜類(罐頭食品)'),
('P_0052', '香椿醬', '全素\r\n可直接拌麵、拌飯、拌菜、夾土司', '品名:香椿醬\r\n成分:香椿、大豆油、大豆蛋白、花瓜、筍豆、香菇、砂糖、豆瓣粒、豆干[豆皮、甘油、砂糖、大豆油、鹽、辣椒、乳酸、甘草、檸檬酸、一品香(桂節、大茴、小茴、丁香枝)、八角]、麻油、番茄醬[番茄糊、水、甘蔗液糖、釀造醋、食鹽、香辛料(麥芽糊精、胡椒、眾香子、辣椒、陳皮、丁香、眾香子抽出物、胡椒抽出物、丁香抽出物、肉桂抽出物)]、L-麩酸鈉、大豆卵磷脂、芝麻、鹽、琥珀酸二鈉、呈味核苷酸二鈉(5-鳥嘌呤核苷磷酸二鈉、5-次黃嘌呤核苷磷酸二鈉)、八角、當歸、黑胡椒粉\r\n內容量:370公克\r\n固形量:340公克\r\n保存期限:常溫下二年(開罐後需冷藏)\r\n原產地:台灣\r\n過敏原:本產品含大豆、芝麻類製品\r\n本產品含非基因改造黃豆原料', 130, 1, '醬菜類(罐頭食品)'),
('P_0053', '香菇素拌醬', '全素\r\n可直接拌麵、拌飯、拌菜、夾土司', '品名:香菇素拌醬\r\n成分:大豆油、豆干[豆皮、甘油、砂糖、大豆油、鹽、辣椒、乳酸、甘草、檸檬酸、一品香(桂節、大茴、小茴、丁香枝)、八角]、味噌、黃豆鼓、香菇、黃豆、大豆蛋白、砂糖、蔭瓜、麻油、花瓜、番茄醬[番茄糊、水、甘蔗液糖、釀造醋、食鹽、香辛料(麥芽糊精、胡椒、眾香子、辣椒、陳皮、丁香、眾香子抽出物、胡椒抽出物、丁香抽出物、肉桂抽出物)]、L-麩酸鈉、琥珀酸二鈉、大豆卵磷脂、鹽、五香粉(小茴、大茴、丁香、桂枝、甘松、三奈)八角、黑胡椒粉、紅椒色素、當歸、呈味核苷酸二鈉(5-鳥嘌呤核苷磷酸二鈉、5-次黃嘌呤核苷磷酸二鈉)、油桂\r\n內容量:370公克\r\n固形量:290公克\r\n原產地:台灣\r\n保存期限:常溫下二年(開罐後須冷藏)\r\n過敏原:本產品含大豆、芝麻類製品\r\n本產品含非基因改造黃豆原料', 130, 1, '醬菜類(罐頭食品)'),
('P_0054', '麻辣香椿醬', '全素\r\n可直接拌麵、拌飯、拌菜、夾土司', '品名:麻辣香椿醬\r\n成分:香椿、辣椒、大豆油、香菇、砂糖、黃豆鼓(基因改造)、花瓜、番茄醬[番茄糊、水、甘蔗液糖、釀造醋、食鹽、香辛料(麥芽糊精、胡椒、眾香子、辣椒、陳皮、丁香、眾香子抽出物、胡椒抽出物、丁香抽出物、肉桂抽出物)]、麻油、L-麩酸鈉、大豆卵磷脂、花椒、檸檬酸、琥珀酸二鈉、八角\r\n內容量:370公克\r\n固形量:340公克\r\n保存期限:常溫下二年(開罐後須冷藏)\r\n原產地:台灣\r\n過敏原:本產品含大豆、芝麻類製品\r\n食用方法:直接加入主食即可食用(加熱後風味更佳)', 130, 1, '醬菜類(罐頭食品)'),
('P_0055', '麻辣香菇', '全素\r\n用途:拌飯、拌麵、清粥小菜、炒菜調味、火鍋湯底', '品名:麻辣香菇\r\n成份:大豆油、朝天椒、香菇、菜脯、砂糖、黃豆鼓、花瓜、酸菜、豆干[豆皮、甘油、砂糖、大豆油、鹽、辣椒、乳酸、甘草、檸檬酸、一品香(桂節、大茴、小茴、丁香枝)、八角]、麻油、番茄醬[番茄糊、水、甘蔗液糖、釀造醋、食鹽、香辛料(麥芽糊精、胡椒、眾香子、辣椒、陳皮、丁香、眾香子抽出物、胡椒抽出物、丁香抽出物、肉桂抽出物)]、L-麩酸鈉、大豆卵磷脂、花椒、一品香(桂節、大茴、小茴、丁香枝)\r\n內容量:380公克\r\n固形量:295公克\r\n保存期限:常溫下2年\r\n食用方法:直接加入主食即可食用(加熱後風味更佳)\r\n產地:台灣\r\n過敏原:本產品含大豆、芝麻類製品\r\n開瓶後需冷藏\r\n本產品含非基因改造黃豆原料', 160, 1, '醬菜類(罐頭食品)');

-- --------------------------------------------------------

--
-- 資料表結構 `reviews`
--

CREATE TABLE `reviews` (
  `review_id` varchar(255) NOT NULL,
  `user_id` varchar(255) NOT NULL,
  `username` varchar(255) NOT NULL,
  `rating` int(11) NOT NULL,
  `content` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `reviews`
--

INSERT INTO `reviews` (`review_id`, `user_id`, `username`, `rating`, `content`) VALUES
('1', '123', '12313', 5, '31231'),
('2', '32', '12', 3, '2');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`order_id`);

--
-- 資料表索引 `product_img`
--
ALTER TABLE `product_img`
  ADD PRIMARY KEY (`img_id`);

--
-- 資料表索引 `product_info`
--
ALTER TABLE `product_info`
  ADD PRIMARY KEY (`product_id`);

--
-- 資料表索引 `reviews`
--
ALTER TABLE `reviews`
  ADD PRIMARY KEY (`review_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
